# GetServiceByGUID Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetServiceByGUID Method
FabricationConfiguration Class See Also
---
Gets the service identifier by its GUID.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int GetServiceByGUID(
	Guid serviceGUID
)
```

Visual Basic
---
```text
Public Function GetServiceByGUID ( _
	serviceGUID As Guid _
) As Integer
```

Visual C++
---
```text
public:
int GetServiceByGUID(
	Guid serviceGUID
)
```

# ### Parameters
serviceGUID
    Type: System..::..Guid The service GUID.
# ### Return Value
The service identifier. Returns 0 if not found.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace